:- dynamic  % èíôîðìèðóåò èíòåðïðåòàòîð î òîì, ÷òî îïðåäåëåíèÿ ïðåäèêàòîâ
            % ìîãóò èçìåíÿòüñÿ â õîäå âûïîëíåíèÿ ïðîãðàììû
ñòóäåíò/4.  % ôîðìàò: <èìÿ ïðåäèêàòà>/<êîë-âî àðãóìåíòîâ>

% ïåðâîíà÷àëüíàÿ áàçà, çàãðóæàåìàÿ ïðè çàïóñêå ïðîãðàììû
%       N   ÔÈÎ             Ãðóïïà  Îöåíêè
ñòóäåíò(1, 'Èâàíîâ À.À.',   'ÈÑ2',  [5, 4, 5, 4, 4]).
ñòóäåíò(2, 'ßõîíòîâ Ì.Â.',  'ÈÑ3',  [4, 5, 5, 5, 5]).
ñòóäåíò(3, 'Âàñíåöîâ Ñ.Ï.', 'ÏÈ1',  [5, 5, 4, 3, 4]).
ñòóäåíò(4, 'Ñåðãååâ Â.Ê.',  'ÓÒÑ1', [3, 3, 3, 4, 3]).

start :- menu.  % ïðåäèêàò äëÿ çàïóñêà ïðîãðàììû

% ====================== ÌÅÍÞ ======================
menu :-
    repeat, nl,

    write('********************************************'), nl,
    write('* 1. Äîáàâëåíèå çàïèñè â ÁÄ                *'), nl,
    write('* 2. Óäàëåíèå çàïèñè èç ÁÄ                 *'), nl,
    write('* 3. Ïðîñìîòð ÁÄ                           *'), nl,
    write('* 4. Çàãðóçêà ÁÄ èç ôàéëà                  *'), nl,
    write('* 5. Ñîõðàíåíèå ÁÄ â ôàéëå                 *'), nl,
    write('* 6. Ðåëÿöèîííûå îïåðàöèè                  *'), nl,

    write('********************************************'), nl,
    write('* 7. Êîððåêòèðîâêà ïî íîìåðó çàïèñè        *'), nl,
    write('* 8. Âûâîä ñòóäåíòîâ ñî ñðåä. áàëëîì > 4.0 *'), nl,

    write('********************************************'), nl,
    write('* 9. Âûõîä                                 *'), nl,
    
    write('********************************************'), nl, nl,
    write('Ââåäèòå íîìåð ïðîöåäóðû (ñ òî÷êîé â êîíöå!):'), nl,

    read(C), nl,    % Ââîä íîìåðà ïðîöåäóðû
    proc(C),        % Çàïóñê ïðîöåäóðû ñ íîìåðîì Ñ
    C=9, ! .        % Åñëè C=9 çàâåðøèòü ïðîãðàììó


% ============= 1. Äîáàâëåíèå çàïèñè â ÁÄ =============
proc(1) :-
    write('--- Ââîä çàâåðøàòü òî÷êîé! ---'), nl,

    write('Ââåäèòå íîìåð:'), nl, read(N),
    write('Ââåäèòå ÔÈÎ: '), nl, read(ÔÈÎ),
    write('Ââåäèòå íîìåð ãðóïïû: '), nl, read(Ãðóïïà),
    write('Ââåäèòå îöåíêè â ôîðìàòå [Îöåíêà1, Îöåíêà2, Îöåíêà3]): '), nl, read(Îöåíêè),

    assertz(ñòóäåíò(N, ÔÈÎ, Ãðóïïà, Îöåíêè)),   % äîáàâëåíèå ôàêòà â ÁÄ
    write('Ñòóäåíò '), display(ÔÈÎ), write(' áûë äîáàâëåí â ÁÄ'), nl.


% ============= 2. Óäàëåíèå çàïèñè èç ÁÄ =============
proc(2) :-
    write('Ââåäèòå íîìåð ñòóäåíòà äëÿ óäàëåíèÿ: '), nl,
    read(N), % ââîä íîìåðà ñîòðóäíèêà

    retract(ñòóäåíò(N, _, _, _)), % óäàëåíèå çàïèñè î ñòóäåíòå

    % çàïèñü óäàëîñü íàéòè óäàëèòü
    write('Ñòóäåíò '), display(N), write(' áûë óñïåøíî óäàëåí èç ÁÄ'), nl,
    
    ! ; % çàâåðøåíèå èëè àëüòåðíàòâà

    % çàïèñü íå íàéäåíà - óäàëèòü íå÷åãî
    write('Òàêîãî ñòóäåíòà â áàçå äàííûõ íåò'), nl.

/*
% ˜˜˜˜˜˜˜˜ ˜˜˜˜ ˜˜˜˜˜˜
proc(3) :-
    ˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
    nl,
    write('˜˜˜˜˜: '), write(N), nl,
    write('˜˜˜˜˜˜˜: '), write(˜˜˜), nl,
    write('˜˜˜: '), write(˜˜˜), nl,
    write('˜˜˜ ˜˜˜˜˜˜˜˜: '), write(˜˜˜˜˜˜˜˜˜˜˜), nl,
    write('˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜: '), write(˜˜˜˜˜˜˜˜˜˜˜˜˜˜), nl,
    write('˜˜˜˜˜˜: '), write(˜˜˜˜˜˜), nl, nl,
    fail;
    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜˜, ˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜...'), nl,
    get0(_), get0(_).
    true. 

% ˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜ ˜˜˜˜˜˜ ˜ ˜˜˜˜˜
proc(4) :-
    tell('db_student.dat'),
    save_db(˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜)),
    told,
    write('˜˜ ˜˜˜˜˜˜˜˜˜˜˜ ˜ ˜˜˜˜ db_student.dat'), nl.

save_db(Term) :-
    Term,
    write(Term), write('.'), nl,
    fail;
    true.

% ˜˜˜˜˜˜˜˜ ˜˜˜˜ ˜˜˜˜˜˜ ˜˜ ˜˜˜˜˜
proc(5) :-
    see('db_student.dat'),
    retractall(˜˜˜˜˜˜˜(_, _, _, _, _, _)),
    db_load,
    seen,
    write('˜˜ ˜˜˜˜˜˜˜˜˜ ˜˜ ˜˜˜˜˜'), nl.

db_load :-
    read(Term),
    ( Term == end_of_file ->
        !;
        write('˜˜˜˜˜˜˜˜˜: '), write(Term), nl, % ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜
        assertz(Term),
        db_load
    ).


% ˜˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ ˜˜ ˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜
proc(6) :-
    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜˜˜ ˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜˜˜:'), nl,
    read(N),
    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜:'), nl,
    read(˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜),
    retract(˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, _, ˜˜˜˜˜˜)),
    assertz(˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜)),
    write('˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜ '), write(N), write(' ˜˜˜˜˜˜˜ ˜˜ '), write(˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜), nl,
    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜˜, ˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜...'), nl,
    get0(_).

% ˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜ ˜˜˜ ˜˜˜˜˜˜
proc(7) :-
    findall(˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           (˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
            ˜˜˜_˜˜˜˜˜˜(˜˜˜˜˜˜)),
            Students),
    (Students = [] ->
        write('˜˜˜˜˜˜˜˜˜ ˜ ˜˜˜˜˜˜˜˜ ˜˜˜.'), nl;
        write('˜˜˜˜˜˜˜˜ ˜ ˜˜˜˜˜˜˜˜:'), nl,
        print_students(Students)),
    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜˜, ˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜...'), nl,
    get0(_), get0(_).

% ˜˜˜˜˜˜˜˜, ˜˜˜ ˜˜˜ ˜˜˜˜˜˜ sd ˜˜˜˜˜˜
˜˜˜_˜˜˜˜˜˜(˜˜˜˜˜˜) :-
    forall(member(˜˜˜˜˜˜, ˜˜˜˜˜˜), ˜˜˜˜˜˜ = 2).

% ˜˜˜˜˜ ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜
print_students([]).
print_students([˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜)|T]) :-
    write('˜˜˜˜˜: '), write(N), nl,
    write('˜˜˜˜˜˜˜: '), write(˜˜˜), nl,
    write('˜˜˜: '), write(˜˜˜), nl,
    write('˜˜˜ ˜˜˜˜˜˜˜˜: '), write(˜˜˜˜˜˜˜˜˜˜˜), nl,
    write('˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜: '), write(˜˜˜˜˜˜˜˜˜˜˜˜˜˜), nl,
    write('˜˜˜˜˜˜: '), write(˜˜˜˜˜˜), nl, nl,
    print_students(T).

% ˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜

proc(8) :-
    nl,
    write('˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ r1: ˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2021 ˜˜˜˜'), nl,
    ˜˜˜˜˜˜˜˜˜˜˜˜_˜˜˜˜˜˜˜˜˜(2021, R1), % R1 - ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2021 ˜˜˜˜
    ˜˜˜˜˜˜_˜_˜˜(R1), % ˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ ˜˜ R1 ˜ ˜˜˜˜ ˜˜˜˜˜˜
    ˜˜˜˜˜_˜˜˜˜˜˜(R1), nl, % ˜˜˜˜˜ ˜˜˜˜˜˜ R1 ˜˜ ˜˜˜˜˜

    write('˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ r2: ˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2020 ˜˜˜˜'), nl,
    ˜˜˜˜˜˜˜˜˜˜˜˜_˜˜˜˜˜˜˜˜˜(2020, R2), % R2 - ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2020 ˜˜˜˜
    ˜˜˜˜˜˜_˜_˜˜(R2), % ˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ ˜˜ R2 ˜ ˜˜˜˜ ˜˜˜˜˜˜
    ˜˜˜˜˜_˜˜˜˜˜˜(R2), nl, % ˜˜˜˜˜ ˜˜˜˜˜˜ R2 ˜˜ ˜˜˜˜˜

    write('˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ r1_˜˜˜_r2: '), nl,
    ˜˜˜˜˜˜˜˜˜˜˜(Rez1), % Rez1 - ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2020 ˜˜˜ 2021 ˜˜˜˜
    ˜˜˜˜˜_˜˜˜˜˜˜(Rez1), nl,

    write('˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ r1_˜_r2: '), nl,
    ˜˜˜˜˜˜˜˜˜˜˜(Rez2), % Rez2 - ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ ˜ 2020, ˜ ˜ 2021 ˜˜˜˜
    ˜˜˜˜˜_˜˜˜˜˜˜(Rez2), nl,

    write('˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ r1-r2: '), nl,
    ˜˜˜˜˜˜˜˜(Rez3), % Rez3 - ˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜ ˜ 2021 ˜˜˜˜, ˜˜ ˜˜ ˜ 2020
    ˜˜˜˜˜_˜˜˜˜˜˜(Rez3), nl,

    write('˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜'), nl,
    get0(_). % ˜˜˜˜˜˜˜˜ ˜˜˜˜˜ ˜˜˜˜˜˜˜

% ˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ ˜˜ ˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜
˜˜˜˜˜˜˜˜˜˜˜˜_˜˜˜˜˜˜˜˜˜(˜˜˜˜˜˜˜˜˜˜˜˜˜˜, R) :-
    bagof(˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           ˜˜˜˜˜˜˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜), R).

% ˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ - r1 ˜˜˜ r2
˜˜˜˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜) :-
    ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2021, ˜˜˜˜˜˜), ˜˜˜˜˜˜˜˜˜˜˜˜˜˜=2021;
    ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2020, ˜˜˜˜˜˜), ˜˜˜˜˜˜˜˜˜˜˜˜˜˜=2020.

% ˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ Rez ˜˜ ˜˜˜˜˜˜ "˜˜˜˜˜˜˜_˜1_˜˜˜_˜2"
˜˜˜˜˜˜˜˜˜˜˜(Rez) :-
    bagof(˜˜˜˜˜˜˜_˜1_˜˜˜_˜2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           ˜˜˜˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           Rez).

% ˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ - r1 ˜ r2
˜˜˜˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜) :-
    ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2021, ˜˜˜˜˜˜),
    ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2020, ˜˜˜˜˜˜).

% ˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ Rez ˜˜ ˜˜˜˜˜˜ "˜˜˜˜˜˜˜_˜1_˜_˜2"
˜˜˜˜˜˜˜˜˜˜˜(Rez) :-
    bagof(˜˜˜˜˜˜˜_˜1_˜_˜2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           ˜˜˜˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           Rez),
    !,
    ˜˜˜˜˜_˜˜˜˜˜˜(Rez).
˜˜˜˜˜˜˜˜˜˜˜([]) :-
    write('˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜!'), nl. % ˜˜˜˜ ˜˜˜˜˜˜ ˜˜˜˜, ˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ ˜ ˜˜˜˜˜˜˜


% ˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜: r1-r2
˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜) :-
    ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2021, ˜˜˜˜˜˜),
    not(˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, 2020, ˜˜˜˜˜˜)).

% ˜˜˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ Rez ˜˜ ˜˜˜˜˜˜ "˜˜˜˜˜˜˜_˜1_˜_˜˜_˜2"
˜˜˜˜˜˜˜˜(Rez) :-
    bagof(˜˜˜˜˜˜˜_˜1_˜_˜˜_˜2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           ˜˜˜˜˜˜˜˜_r1_r2(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
           Rez).

% ˜˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ ˜˜ ˜˜˜˜˜˜ [H|T] ˜ ˜˜
˜˜˜˜˜˜_˜_˜˜([]).
˜˜˜˜˜˜_˜_˜˜([H|T]) :-
    H = ˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜),
    assertz(˜˜˜˜˜˜˜_˜(N, ˜˜˜, ˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜˜˜˜˜˜˜˜˜, ˜˜˜˜˜˜)),
    ˜˜˜˜˜˜_˜_˜˜(T).

% ˜˜˜˜˜ ˜˜˜˜˜˜˜˜˜ ˜˜˜˜˜˜ [H|T] ˜ ˜˜˜˜˜˜ ˜˜˜˜˜˜
˜˜˜˜˜_˜˜˜˜˜˜([]).
˜˜˜˜˜_˜˜˜˜˜˜([H|T]) :-
    write(H), nl,
    ˜˜˜˜˜_˜˜˜˜˜˜(T).
*/

% ====================== 9. Âûõîä ======================
proc(9) :- 
    write('Äî ñâèäàíèÿ.'), nl.